#+TITLE: March 29, 2017 - April 10, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                           | CANCELED |
|------+------+-------------+---------+----------------------------------------------------------------+----------|
|      |      |             |         | KERNEL.1490768194. Linux Device Drivers, 3rd edit (2017-04-13) |          |
|      |      |             |         | KERNEL.1489241685. Test suite for shakthimaan Lin (2017-04-13) |          |
|      |      |             |         | WEB.1490857410. Reselling ticket Django applic (2017-04-13)    |          |
|      |      |             |         | WRITING.1489394843. [Blog] PLUG Clipart Hackatho (2017-04-01)  |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME   | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|--------+-----------+--------+------+-----------+--------------+------------|
| Mbuf   |         0 |      0 |    0 |         0 |   2017-04-13 | ---------- |
| Mpduty |      20.0 |   15.0 | 20.0 |         0 |   2017-04-13 | ########## |
| Imack  |      23.0 |    7.5 | 23.0 |         0 |   2017-04-13 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED    |
|-----+------------+--------+-------+--------------------|
|   1 | 2017-03-29 |   45.5 |    42 |                    |
|   2 | 2017-03-30 |   45.5 |    38 |                    |
|   3 | 2017-03-31 |   45.5 |    35 |                    |
|   4 | 2017-04-01 |   43.0 |    32 | WRITING.1489394843 |
|   5 | 2017-04-02 |   43.0 |    28 |                    |
|   6 | 2017-04-03 |   43.0 |    24 |                    |
|   7 | 2017-04-04 |   43.0 |    21 |                    |
|   8 | 2017-04-05 |   43.0 |    18 |                    |
|   9 | 2017-04-06 |   43.0 |    14 |                    |
|  10 | 2017-04-07 |   43.0 |    10 |                    |
|  11 | 2017-04-08 |   43.0 |     7 |                    |
|  12 | 2017-04-09 |   43.0 |     4 |                    |
|  13 | 2017-04-10 |   43.0 |     0 |                    |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                                | TASKID             | OWNER  | PRIORITY | TODO | ESTIMATED | ACTUAL |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| * TASKS                                                             |                    |        | B        |      |      45.5 |   24.5 |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** KERNEL                                                           |                    |        | B        |      |      20.0 |   15.0 |
| *** Linux Device Drivers, 3rd edition, Part III [2/8]               | KERNEL.1490768194  | mpduty | B        | DONE |      12.0 |  12.75 |
| *** Test suite for shakthimaan Linux device driver code examples II | KERNEL.1489241685  | mpduty | B        | DONE |       8.0 |   2.25 |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** WEB                                                              |                    |        | B        |      |      23.0 |    7.5 |
| *** Reselling ticket Django application module I [6/12]             | WEB.1490857410     | imack  | B        | DONE |      23.0 |    7.5 |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** WRITING                                                          |                    |        | B        |      |       2.5 |    2.0 |
| *** [Blog] PLUG Clipart Hackathon                                   | WRITING.1489394843 | shaks  | B        | DONE |       2.5 |    2.0 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2017-03-29 Wed>
  :wpd-imack:       2
  :wpd-mpduty:      2
  :wpd-mbuf:        1
  :END:
** KERNEL
*** DONE Linux Device Drivers, 3rd edition, Part III [2/8]
    CLOSED: [2017-04-13 Thu 15:19]
    :PROPERTIES:
    :ESTIMATED: 12.0
    :ACTUAL: 12.75
    :OWNER: mpduty
    :ID: KERNEL.1490768194
    :TASKID: KERNEL.1490768194
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-09 Sun 05:10]--[2017-04-09 Sun 09:30] =>  4:20
    CLOCK: [2017-04-08 Sat 08:00]--[2017-04-08 Sat 10:45] =>  2:45
    CLOCK: [2017-04-05 Wed 10:15]--[2017-04-05 Wed 12:10] =>  1:55
    CLOCK: [2017-03-30 Thu 21:00]--[2017-03-30 Thu 23:20] =>  2:20
    CLOCK: [2017-03-29 Wed 09:15]--[2017-03-29 Wed 10:40] =>  1:25
    :END:
    - [X] Chapter 11: Data Types in the Kernel
    - [X] Chapter 12: PCI Drivers
*** DONE Test suite for shakthimaan Linux device driver code examples II
    CLOSED: [2017-04-13 Thu 15:17]
    :PROPERTIES:
    :ESTIMATED: 8.0
    :ACTUAL: 2.25
    :OWNER: mpduty
    :ID: KERNEL.1489241685
    :TASKID: KERNEL.1489241685
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-09 Sun 11:40]--[2017-04-09 Sun 14:05] =>  2:25
    :END:
** WEB 
*** DONE Reselling ticket Django application module I [6/12]
    CLOSED: [2017-04-13 Thu 15:22]
    :PROPERTIES:
    :ESTIMATED: 23.0
    :ACTUAL: 7.5
    :OWNER: imack
    :ID: WEB.1490857410
    :TASKID: WEB.1490857410
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-04 Tue 21:00]--[2017-04-04 Tue 22:00] =>  1:00
    CLOCK: [2017-04-03 Mon 22:15]--[2017-04-03 Mon 23:15] =>  1:00
    CLOCK: [2017-04-02 Sun 22:00]--[2017-04-02 Sun 23:30] =>  1:30
    CLOCK: [2017-04-01 Sat 23:00]--[2017-04-02 Sun 00:00] =>  1:00
    CLOCK: [2017-03-31 Fri 23:00]--[2017-04-01 Sat 01:00] =>  2:00
    CLOCK: [2017-03-30 Thu 21:00]--[2017-03-30 Thu 22:00] =>  1:00
    :END:
    - [X] 30-03-17: Planning the architecture of the app [2 hours]
    - [X] 31-03-17: Creating the models part 1 [2 hours]
    - [X] 01-04-17: Creating models part 2. [2 hours]
    - [X] 02-04-17: Creating views part 1 [2 hours]
    - [X] 03-04-17: Creating views part 2 [2 hours]
    - [X] 04-04-17: Searching and planning for the html layout of the app. [2 hours]
** WRITING
*** DONE [Blog] PLUG Clipart Hackathon
    CLOSED: [2017-04-01 Sat 18:41]
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL: 2.0
    :OWNER: shaks
    :ID: WRITING.1489394843
    :TASKID: WRITING.1489394843
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-01 Sat 16:30]--[2017-04-01 Sat 18:30] =>  2:00
    :END:
